import streamlit as st


st.image("./fantazip_logo.png")

st.title("🏡나의 판타집이 알려준다!")
st.subheader("데이터로 보는 2030 사회초년생 1인가구를 위한 살기 좋은 동네 추천 서비스")
st.divider()

st.subheader("❓나의 판타집이 무엇인가요?")
# 수정 필요
st.write("**나의 판타집**팀은 멀티캠퍼스 데이터 분석 및 서비스 개발 교육의 일부인 파이널 프로젝트를 진행하기 위해 만들어진 팀으로, ~~~~")

st.subheader("❓왜 2030 사회초년생을 대상으로 하나요?")
st.write("처음 자취를 시작하는 사회초년생들이 자신에게 맞는 동네를 잘 선택할 수 있도록 돕는 데에 있습니다. 사용자 취향과 우선순위에 맞게 여러 요인을 고려하여 선호 동네를 커스터마이징 할 수 있다는 점이 현재의 서비스들과의 차별점이라고 할 수 있겠습니다.\n 치안, 교통 등 다양한 요인을 사용자의 취향에 맞게 교려하여 동네를 추천해주는 것이 이 서비스의 핵심 내용입니다.")

st.subheader("❓왜 살기좋은 동네를 추천하는 서비스를 만들었나요?")
st.write("정보의 산재로 인해 자취를 처음 하는 사람들에게 동네를 결정하는 일은 매우 어렵다고 생각합니다. 또한 사람마다 뭔하는 동네 형태가 매우 다양하고요. 이런 문제를 해결하고자 2030 특성을 고려한 정보(치안, 문화예술, 교통, 가격, 편의시설)를 한 곳에 모다 개개인의 취향에 맞게 설정하여 통합적인 관점에서 **'나'**에게 맞는 동네를 데이터에 기반하여 추천하고자 하였습니다. 뿐만 아니라 요즘 핫한 chatGPT를 활용하여 서울 시민이 될 사회초년생분들께 도움이 될만한 동네 정보를 함께 제공하고자 하였습니다.")